{
  "dark_mode": "Toggle to dark mode",
  "light_mode": "Toggle to light mode",
  "spanish": "Switch to Spanish",
  "english": "Switch to English",
  "home": {
    "welcome": {
      "title": "Hi there!",
      "name": "I'm Sergio",
      "description": {
        "1": "A software engineer",
        "2": "& student"
      }
    },
    "about": {
      "subtitle": "About me",
      "text": {
        "1": "I'm a 20 year old computer engineer student at UDG.",
        "2": "In my journey as a developer I've worked with talented people because I enjoy learning and collaborating to create beautiful and innovating products."
      },
      "resume": "Download my resume"
    },
    "skills": {
      "text": {
        "1": "Through the years I've learned a lot in all sorts of technologies for web development and computer engineering.",
        "2": "This skills have helped me build applications to solve real life problems."
      },
      "col_1": "Programming",
      "col_2": "Libraries & frameworks",
      "col_3": "Tools & platforms"
    },
    "projects_section": {
      "title": "Projects",
      "link": "VIEW PROJECT",
      "projects": {
        "mim": {
          "name": "Master Incident Manager",
          "description": "An issue tracker made to help Cisco Supply Chain to keep track, analyzing and providing solutions for incidents inside the company."
        },
        "chatify": {
          "name": "Chatify",
          "description": "A real time chat web application to chat with everyone around the world."
        },
        "hpwiki": {
          "name": "Harry Potter Wiki",
          "description": "A website for Potterheads like me with fun facts and info about the Harry Potter universe."
        },
        "azahares-leslie": {
          "name": "Azahares Leslie",
          "description": "A landing  page for a local business."
        }
      }
    },
    "contact": {
      "title": "Contact me",
      "message_1": "Hey, thanks for reaching out, here's my email",
      "message_2": "Or fill out this form to send me a message",
      "label_1": "NAME",
      "label_2": "EMAIL",
      "label_3": "MESSAGE",
      "button_text": "Send message",
      "submitted_text": "Thanks! I'll try to reply as soon as posible",
      "error": "Something went wrong, try contacting me on twitter instead"
    }
  },
  "project_page": {
    "stack_title": "Tech Stack",
    "stack_explanation_title": "Stack explanation",
    "motivation_title": "Motivation",
    "solution_title": "Solution",
    "website": "LIVE SITE",
    "mim": {
      "description": "This was part of the Cisco Mexico University Challenge where I worked with a team to build an incident tracker for the Supply Chain Area of Cisco, this would allow employees to log issues and analize possible solutions for new incidents based on the issues history.",
      "stack": {
        "react": "The project had to be an interactive platform so we had to choose a frontend framework to make things easy. We ended up using React because some of the team members had already worked with it in the past and because it provides a lot of scalability which was one of the requirements.",
        "flask": "For the backend we chose Flask. We would build machine learning algorithms to provide possible solutions for new incidents, so the best option was to use Python. However the team was not very experienced in this language so Flask looked as the most easy framework to use and learn.",
        "azure": "As the project continued, we realized we required a file storage platform since users needed to be able to upload files like logs or screenshots. After looking into the different options, we chose Microsoft Azure Blob Storage for its easy integration with Flask."
      },
      "motivation": "Cisco's products are manufactured by 3rd party companies across the globe. These factories rely greatly on technology solutions, each enabled by a separate Cisco group, and hence the visibility on current activities, planned changes, and how to react in case of problems is difficult for Cisco partners to piece together.",
      "solution": {
        "text": "The final product was the Master Incident Manager, an issue tracker where Cisco partners have a central place for researching and quantifying the current incidents and root causes. This allows users to log, monitor and resolve issues. The project considers the following:",
        "list": {
          "1": "Its easy to research on issues, resolutions and sites",
          "2": "Its easy to use and understand regardless of global language differences",
          "3": "The project is able to categorize issues based on priorities",
          "4": "The platform implements role-based access",
          "5": "Considers data and network security",
          "6": "Helps to quickly identify root causes, whether they are software of hardware issues"
        }
      }
    },
    "chatify": {
      "description": "A progressive web application where you can chat with anyone around the world in real-time.",
      "stack": {
        "react": "This webapp had to be built with a frontend framework and React is the one that I have more experience with.",
        "socket_io": "For the real-time communication I chose socket.io, a powerfull and fast engine. It works on every platform, browser or device, so it is the best option out there.",
        "node": "Its very easy to integrate socket.io with the Express framework so I chose NodeJs for the backend to handle sending and recieving messages."
      },
      "motivation": "I wanted to learn how websockets and PWA's worked and also I wanted to improve my expertise in React so I decided to build a real-time chat wich is an impressive but simple project.",
      "solution": {
        "text": "The final product is a progressive web application that uses a powerfull engine for real-time communication so you can send messages and everyone that uses the app will recieve it. It also provides the following features:",
        "list": {
          "1": "A central panel to see all messages sent in the history of the app",
          "2": "A panel that displays all users that are currently on the chat room",
          "3": "Provides an emoji parser, so if you send ':D' you will see 😀"
        }
      }
    },
    "hp": {
      "description": "A fun website for all Potterheads out there where you can discover fun facts, see info about the Hogwarts Houses and even discover what house you belong to.",
      "stack": {
        "gatsby": "I chose Gatsby for this static site since it is one of the best frameworks for React and helps you build blazing fast websites."
      },
      "motivation": "I'm a Potterhead myself so it was a good opotunity to show it off and look into Gatsby since I've seen a lot of people talk about how you can build super fast static websites with it, I tried it out and I had an amazing experience.",
      "solution": {
        "text": "The final product is a PWA with offline mode where you can find info about spells used in the Harry Potter movies, the characters and some fun facts. It also provides the following features:",
        "list": {
          "1": "Modal components with the info of the Hogwarts Houses",
          "2": "A place to discover the house you belong to",
          "3": "A page with all the characters and spells from the Wizarding World displayed in an awesome Accordion component",
          "4": "A page to discover some fun fact about the Harry Potter universe"
        }
      }
    },
    "azahares": {
      "description": "A landing page made for a local business to showcase what they do.",
      "stack": {
        "react": "Honestly this was not the best decision, I could've built it with plain HTML/CSS. Also at the moment I didn't know Gatsby."
      },
      "motivation": "A local business needed a website so clients could see what they do and what products they offer.",
      "solution": {
        "text": "The final product is a website to showcase the products the company offers and the information about it so that clients can contact them. This webpage provides:",
        "list": {
          "1": "Cool animations like image fade-in",
          "2": "A nice modern and elegant design",
          "3": "A gallery of the products offered by the business"
        }
      }
    }
  }
}
