{
  "dark_mode": "Toggle to dark mode",
  "light_mode": "Toggle to light mode",
  "spanish": "Switch to Spanish",
  "english": "Switch to English",
  "home": {
    "welcome": {
      "title": "Hi there!",
      "name": "I'm Sergio",
      "description": {
        "1": "A software engineer",
        "2": "& student"
      }
    },
    "about": {
      "subtitle": "About me",
      "text": {
        "1": "I'm a 21 year old computer engineer student at UDG with passion in developing innovative and modern technological products in order to solve problems",
        "2": "I also believe that collaboration and cooperation are a very important aspect of life, which is why throughout my growth as a developer I've worked alongside some brilliant people from whom I've learned a lot."
      },
      "resume": {
        "note": "If you prefer, you can ",
        "link": "download my resume"
      }
    },
    "skills": {
      "text": "Through the years I've learned a lot in all sorts of technologies for development and for software engineer. These technologies have helped me build applications that serve a purpose and solve real life problems",
      "col_1": "Programming",
      "col_2": "Libraries & frameworks",
      "col_3": "Tools & platforms"
    },
    "experience_section": {
      "title": "Experience",
      "read_more": "Read more",
      "read_less": "Read less",
      "cisco": {
        "role": "Software intern",
        "date_period": "Feb 2020 - Jun 2020",
        "description_short": "A worked alongside 4 talented interns to solve a current problem inside the Supply Chain Area of Cisco, the issue was that there was no way to keep track of incidents, errors and problems that happened everyday, hence the necessity of building a platform to satisfy this need.",
        "description": "A worked alongside 4 talented interns to solve a current problem inside the Supply Chain Area of Cisco, the issue was that there was no way to keep track of incidents, errors and problems that happened everyday, hence the necessity of building a platform to satisfy this need. I was in constant collaboration, not just with my team but also with a mentor, who helped us a lot and from whom we learned so much. We were also in direct contact with the project leaders, who often did an analysis of our progress, propose changes and include new requirements for the system. I met a lot of people here, I learned so much and I had so much fun because it was an amazing experience."
      },
      "ibm": {
        "1": {
          "role": "Student (software)",
          "date_period": "Feb 2021 - Jun 2021",
          "description_short": "I joined a team as a student, here I worked in an existing application where IBM client could buy software. I had never learned so much as I did in this internship because it was my first real approximation to a real job with a team working with Scrum in a very large project.",
          "description": "I joined a team as a student, here I worked in an existing application where IBM client could buy software. I had never learned so much as I did in this internship because it was my first real approximation to a real job with a team working with Scrum in a very large project. I had the opportunity to meet more experienced developers from whom I learned so much, not just about programming, but about how to work more efficiently, how to have a better work-life balance. I learned not just about code, I also developed my soft skills like never before. Since the beginning of this internship everyone supported and helped me, they included me in the project as if I were another developer and team member. I didn't stop learning in this internship and even though the application was colossal I never felt pressured. I also met some more interns during this time and we had good times with them."
        },
        "2": {
          "role": "Application developer",
          "date_period": "Jun 2021 - Today",
          "description_short": "After working as a student, IBM decided to hire me as a fulltime employee, this of course comes with much more responsibilities and dedication. Today I'm still working on the same project I worked when I was an intern but I keep learning everyday something new.",
          "description": "After working as a student, IBM decided to hire me as a fulltime employee, this of course comes with much more responsibilities and dedication. Today I'm still working on the same project I worked when I was an intern but I keep learning everyday something new. Among my responsibilities are to provide support for the application as well as including new requirements. Also the project migration to modern technologies since it is currently running under very old frameworks and we are working on modernizing it. In general I'm working with Java, JSP and devOps services like Kubernetes and Docker."
        }
      }
    },
    "projects_section": {
      "title": "Projects",
      "link": "VIEW PROJECT",
      "projects": {
        "mim": {
          "name": "Master Incident Manager",
          "description": "An issue tracker made to help Cisco Supply Chain to keep track, analyzing and providing solutions for incidents inside the company."
        },
        "chatify": {
          "name": "Chatify",
          "description": "A real time chat web application to chat with everyone around the world."
        },
        "hpwiki": {
          "name": "Harry Potter Wiki",
          "description": "A website for Potterheads with fun facts and info about the Harry Potter universe."
        }
      }
    },
    "contact": {
      "title": "Contact me",
      "message_1": "Hey, thanks for reaching out, here's my email",
      "message_2": "Or fill out this form to send me a message",
      "label_1": "NAME",
      "label_2": "EMAIL",
      "label_3": "MESSAGE",
      "button_text": "Send message",
      "submitted_text": "Thanks! I'll try to reply as soon as possible",
      "error": "Something went wrong, try contacting me on twitter instead"
    }
  },
  "project_page": {
    "stack_explanation_title": "Stack explanation",
    "motivation_title": "Motivation",
    "solution_title": "Final product",
    "website": "LIVE SITE",
    "mim": {
      "description": "This was part of the Cisco Mexico University Challenge where I worked with a team to build an incident tracker for the Supply Chain Area of Cisco, this would allow employees to log issues and analize possible solutions for new incidents based on the issues history.",
      "stack": {
        "react": "The project had to be an interactive platform so we had to choose a frontend framework to make things easy. We ended up using React because some of the team members had already worked with it in the past and because it provides a lot of scalability which was one of the requirements.",
        "flask": "For the backend we chose Flask. We would build machine learning algorithms to provide possible solutions for new incidents, so the best option was to use Python. However the team was not very experienced in this language so Flask looked as the most easy framework to use and learn.",
        "azure": "As the project continued, we realized we required a file storage platform since users needed to be able to upload files like logs or screenshots. After looking into the different options, we chose Microsoft Azure Blob Storage for its easy integration with Flask."
      },
      "motivation": "Cisco's products are manufactured by 3rd party companies across the globe. These factories rely greatly on technology solutions, each enabled by a separate Cisco group, and hence the visibility on current activities, planned changes, and how to react in case of problems is difficult for Cisco partners to piece together.",
      "solution": {
        "text": "The final product was the Master Incident Manager, an issue tracker where Cisco partners have a central place for researching and quantifying the current incidents and root causes. This allows users to log, monitor and resolve issues. The project considers the following:",
        "list": {
          "1": "Its easy to research on issues, resolutions and sites",
          "2": "Its easy to use and understand regardless of global language differences",
          "3": "The project is able to categorize issues based on priorities",
          "4": "The platform implements role-based access",
          "5": "Considers data and network security",
          "6": "Helps to quickly identify root causes, whether they are software of hardware issues"
        }
      }
    },
    "chatify": {
      "description": "A progressive web application (PWA) that uses websockets so that users can chat with any person that is currently in the chatroom in any part of the world.",
      "stack": {
        "react": "This webapp had to be built with a frontend framework so that it could interactive and be able to automatically display every message when they were sent and React was the one that I have more experience with.",
        "socket_io": "For the real-time communication I chose socket.io, a powerful and fast engine. It works on every platform, browser or device, so it is the best option out there.",
        "node": "Its very easy to integrate socket.io with the Express framework so I chose NodeJs for the backend to handle sending and recieving messages."
      },
      "motivation": "I wanted to learn how websockets and PWA's worked and also I wanted to improve my expertise in React so I decided to build a real-time chat wich is an impressive but simple project.",
      "solution": {
        "text": "The final product is a progressive web application that uses a powerful engine for real-time communication so you can send messages and everyone that uses the app will recieve it. It also provides the following features:",
        "list": {
          "1": "A central panel to see all messages sent in the history of the app",
          "2": "A panel that displays all users that are currently on the chat room",
          "3": "Provides an emoji parser, so if you send ':D' you will see 😀"
        }
      }
    },
    "hp": {
      "description": "A fun website for all Potterheads out there where you can discover fun facts, see info about the Hogwarts Houses and even discover what house you belong to.",
      "stack": {
        "gatsby": "I chose Gatsby for this static site since it is one of the best frameworks for React and helps you build blazing fast websites."
      },
      "motivation": "I'm a Potterhead myself so it was a good opotunity to show it off and look into Gatsby since I've seen a lot of people talk about how you can build super fast static websites with it, I tried it out and I had an amazing experience.",
      "solution": {
        "text": "The final product is a PWA with offline mode where you can find info about spells used in the Harry Potter movies, the characters and some fun facts. It also provides the following features:",
        "list": {
          "1": "Modal components with the info of the Hogwarts Houses",
          "2": "A place to discover the house you belong to",
          "3": "A page with all the characters and spells from the Wizarding World displayed in an awesome Accordion component",
          "4": "A page to discover some fun fact about the Harry Potter universe"
        }
      }
    }
  }
}
