{
  "dark_mode": "Activar modo oscuro",
  "home": {
    "welcome": {
      "title": "Hola!",
      "name": "Soy Sergio",
      "description": {
        "1": "Ingeniero de software",
        "2": "& estudiante"
      }
    },
    "about": {
      "subtitle": "Acerca de mi",
      "text": {
        "1": "Soy un estudiante de ingenier칤a en computaci칩n en UDG",
        "2": "En mi viaje como desarrollador he trabajado con personas muy talentosas porque me gusta aprender y colaborar para crear incre칤bles e inovadores productos."
      },
      "resume": "Ve mi curr칤culum"
    },
    "skills": {
      "text": {
        "1": "A lo largo de los a침os he aprendido bastante sobre diversas tecnolog칤as para desarrollo web e ingenier칤a de software.",
        "2": "Estas tecnolog칤as me han ayudado a crear aplicaciones que resuelvan problemas del mundo real."
      },
      "col_1": "Programaci칩n",
      "col_2": "Librer칤as & frameworks",
      "col_3": "Herramientas & plataformas"
    },
    "projects_section": {
      "title": "Proyectos",
      "link": "VER PROJECTO",
      "projects": {
        "mim": {
          "name": "Master Incident Manager",
          "description": "Administrador de incidentes para ayudar a Cisco Supply Chain a llevar un registro, analizar y proveer soluciones de incidentes dentro de la compa침ia."
        },
        "chatify": {
          "name": "Chatify",
          "description": "Aplicaci칩n web para chatear en tiempo real con cualquier persona del mundo."
        },
        "hpwiki": {
          "name": "Harry Potter Wiki",
          "description": "P치gina web para Ptterheads como yo con datos curiosos e informaci칩n interesante sobre el universo de Harry Potter."
        },
        "azahares-leslie": {
          "name": "Azahares Leslie",
          "description": "P치gina web para un negocio local de azahares."
        }
      }
    },
    "contact": {
      "title": "Cont치ctame",
      "message_1": "Gracias por querer contactarme, aqu칤 est치 mi correo",
      "message_2": "O llena el siguiente formulario para enviarme un mensaje",
      "label_1": "NOMBRE",
      "label_2": "CORREO",
      "label_3": "MENSAJE",
      "button_text": "Enviar mensaje",
      "submitted_text": "Gracias! Intentar칠 responder tan pronto como pueda",
      "error": "Algo sali칩 mal, m치ndame DM en twitter"
    }
  },
  "project_page": {
    "stack_title": "Tecnolog칤as",
    "stack_explanation_title": "Explicaci칩n de las tecnolog칤as elegidas",
    "motivation_title": "Motivaci칩n",
    "website": "SITIO WEB",
    "solution_title": "Soluci칩n",
    "mim": {
      "description": "Este proyecto fue parte del Cisco Mexico University Challenge donde trabaj칠 con un equipo para crear un administrador de incidentes para el 치rea de Supply Chain. Este ayudar칤a a que los empleados pudieran llevar seguimiento de los errores y analizar las posibles soluciones para los nuevos incidentes en base al historial de estos.",
      "stack": {
        "react": "El proyecto deb칤a ser una plataforma interactiva as칤 que se tuvo que elegir un framework para el frontend. Terminamos usando React porque varios de los miembros del equipo hab칤an trabajado con el anteriormente. Adem치s React nos ofrece mucha escalabilidad, la cual era un requerimiento para el proyecto.",
        "flask": "Para el backend escogimos Flask. Implementar칤amos algoritmos de machine learning para proveer soluciones a los nuevos incidentes, por lo que la mejor opci칩n era usar Python, sin embargo el equipo no ten칤a mucha experiencia con este, por lo que Flask era la mejor opci칩n pues es f치cil de usar y aprender.",
        "azure": "A medio camino del proyecto, nos dimos cuenta de que se requer칤a una plataforma para guardar archivos, pues los usuarios tendr칤an la opci칩n de subir reportes o capturas de pantalla. Despu칠s de analizar las diferentes opciones nos decidimos por Microsoft Azure Blob Storage por su f치cil integraci칩n con Flask."
      },
      "motivation": "Los productos de Cisco est치n creados por compa침칤as de terceros a trav칠s del mundo. Estas empresas se rigen por diferentes soluciones tecnol칩gicas, cada una de estas creadas por los diferentes grupos de Cisco, por lo que la visibilidad de las actividades, los planes de cambios y el c칩mo reaccionar en caso de problemas son dif칤ciles de unificar para los partners de Cisco.",
      "solution": {
        "text": "El producto final es el Master Incident Manager, un administrador de incidentes donde los partners de Cisco tienen un sitio central para analizar y cuantificar los problemas actuales y las causas ra칤ces. Este ayuda a los usuarios a llevar un registro, monitorear y resolver incidentes. Este proyecto toma las siguientes consideraciones:",
        "list": {
          "1": "Es f치cil ver los incidentes y su resoluci칩n",
          "2": "Es f치cil de usar y entender sin importar de las diferencias de idioma",
          "3": "El sistema es capaz de categorizar los incidentes en base a prioridades",
          "4": "La plataforma cuenta con acceso en base a roles",
          "5": "Considera seguridad de la informaci칩n y protecci칩n de red",
          "6": "Ayuda a identificar r치pidamente las causas ra칤z, ya sea de hardware o software"
        }
      }
    },
    "chatify": {
      "description": "Una progressive web application (PWA) en la que puedes chatear con cualquier persona del mundo en tiempo real.",
      "stack": {
        "react": "Esta aplicaci칩n ten칤a que ser creada con un framework para el frontend y React era con el que ten칤a m치s experiencia.",
        "socket_io": "Para la comunicaci칩n en tiempo real eleg칤 socket.io, un motor r치pido y poderoso. Funciona en cualquier plataforma, navegador o dispositivo, as칤 que es la mejor opci칩n.",
        "node": "La integraci칩n de socket.io con Express es muy f치cil as칤 que decid칤 usar NodeJs para el backend, para manejar el env칤o y recepci칩n de mensajes."
      },
      "motivation": "Quer칤a aprender c칩mo funcionaban los websockets y las PWA's. Adem치s quer칤a mejorar mis habilidades en React as칤 que decid칤 crear un chat en tiempo real, el cual es un project simple pero impresionante.",
      "solution": {
        "text": "El producto final es una progressive web application que usa un poderoso motor para comunicaci칩n en tiempo real en el que puedes enviar mensajes y cualquier persona que est칠 en la aplicaci칩n lo va a recivir. Tambi칠n provee las siguientes caracter칤sticas:",
        "list": {
          "1": "Un panel central para ver todos los mensajes que se han enviado a lo largo de la historia del chat",
          "2": "Un panel que muestra todos los usuarios que est치n actualmente en la sala del chat",
          "3": "Un emoji parser, as칤 que si env칤as ':D' lo que ver치s ser치 游"
        }
      }
    },
    "hp": {
      "description": "Una divertida p치gina web para todos los Potterheads donde puedes ver datos curiosos, la informaci칩n de las casas de Hogwarts e incluso descubrir a cu치l perteneces.",
      "stack": {
        "gatsby": "Decid칤 usar Gatsby para este static site porque es uno de los mejores frameworks para React y ayuda a crear websites s칰per r치pidos."
      },
      "motivation": "Soy un Potterhead as칤 que pens칠 que era una buena oportunidad de mostrarlo y de probar Gatsby, pues he escuchado a mucha gente decir lo r치pidas que pueden ser las p치ginas hechas de estas manera. Lo prob칠, qued칠 fascinado y con un buen sabor de boca.",
      "solution": {
        "text": "El producto final es una PWA que cuenta con un modo offline donde puedes ver informaci칩n acerca de los hechizos usados en las pel칤culas de Harry Potter, los personajes y algunos datos curiosos. Tambi칠n provee las siguientes caracter칤sticas:",
        "list": {
          "1": "Un componente de Modal con la informaci칩n de cada una de las casas de Hogwarts",
          "2": "Un lugar donde puedes descubrir a qu칠 casa perteneces",
          "3": "Una p치gina con todos los personajes y los hechizos del mundo m치gico mostrados en un cool  componente de Accordion",
          "4": "Una p치gina para descubrir datos curiosos sobre el universo de Harry Potter"
        }
      }
    },
    "azahares": {
      "description": "Una landing page para un negocio local que muestre lo que hacen.",
      "stack": {
        "react": "Honestamente esta no fue la mejor decisi칩n. Se podr칤a haber creado con HTML/CSS. Tambi칠n en ese momento no conoc칤a Gatsby."
      },
      "motivation": "Un negocio local necesitaba una p치gina web para que los clientes vieran qu칠 hac칤an y qu칠 productos ofrec칤an.",
      "solution": {
        "text": "El producto final es una p치gina web donde se muestra qu칠 ofrece el negocio y la informaci칩n acerca de ellos para que se facilite la comunicaci칩n con los clientes. Esta p치gina provee:",
        "list": {
          "1": "Animaciones cool como fade-in en las im치genes ",
          "2": "Un dise침o elegante y moderno",
          "3": "Una galer칤a de productos ofrecidos por el negocio"
        }
      }
    }
  }
}
