{
  "dark_mode": "Cambiar a modo oscuro",
  "light_mode": "Cambiar a modo claro",
  "spanish": "Cambiar a español",
  "english": "Cambiar a inglés",
  "home": {
    "welcome": {
      "title": "Hola!",
      "name": "Soy Sergio",
      "description": {
        "1": "Ingeniero de software",
        "2": "& estudiante"
      }
    },
    "about": {
      "subtitle": "Acerca de mi",
      "text": {
        "1": "Soy un estudiante de ingeniería en computación en UDG",
        "2": "En mi viaje como desarrollador he trabajado con personas muy talentosas porque me gusta aprender y colaborar para crear increíbles e inovadores productos."
      },
      "resume": "Ve mi currículum"
    },
    "skills": {
      "text": {
        "1": "A lo largo de los años he aprendido bastante sobre diversas tecnologías para desarrollo web e ingeniería de software.",
        "2": "Estas tecnologías me han ayudado a crear aplicaciones que resuelvan problemas del mundo real."
      },
      "col_1": "Programación",
      "col_2": "Librerías & frameworks",
      "col_3": "Herramientas & plataformas"
    },
    "experience_section": {
      "title": "Experiencia profesional",
      "cisco": {
        "role": "Becario de software",
        "date_period": "Feb 2020 - Jun 2020",
        "description": "Como parte de un equipo, diseñé y desarrollé una plataforma de software para dar tracking a incidentes dentro del área de Supply Chain de Cisco, esto ayudaría a los empleados a monitorear errores y analizar posibles soluciones para los nuevos incidentes en base en los historicos"
      },
      "ibm": {
        "1": {
          "role": "Estudiante (software)",
          "date_period": "Feb 2021 - Jun 2021",
          "description": "Estuve como estudiante"
        },
        "2": {
          "role": "Desarrollador de aplicaciones",
          "date_period": "Jun 2021 - Hoy",
          "description": "Entré como empledo regular"
        }
      }
    },
    "projects_section": {
      "title": "Proyectos",
      "link": "VER PROYECTO",
      "projects": {
        "mim": {
          "name": "Master Incident Manager",
          "description": "Administrador de incidentes para ayudar a Cisco Supply Chain a llevar un registro, analizar y proveer soluciones de incidentes dentro de la compañia."
        },
        "chatify": {
          "name": "Chatify",
          "description": "Aplicación web para chatear en tiempo real con cualquier persona del mundo."
        },
        "hpwiki": {
          "name": "Harry Potter Wiki",
          "description": "Página web para Ptterheads como yo con datos curiosos e información interesante sobre el universo de Harry Potter."
        }
      }
    },
    "contact": {
      "title": "Contáctame",
      "message_1": "Gracias por querer contactarme, aquí está mi correo",
      "message_2": "O llena el siguiente formulario para enviarme un mensaje",
      "label_1": "NOMBRE",
      "label_2": "CORREO",
      "label_3": "MENSAJE",
      "button_text": "Enviar mensaje",
      "submitted_text": "Gracias! Intentaré responder tan pronto como pueda",
      "error": "Algo salió mal, mándame DM en twitter"
    }
  },
  "project_page": {
    "stack_title": "Tecnologías",
    "stack_explanation_title": "Explicación de las tecnologías elegidas",
    "motivation_title": "Motivación",
    "website": "SITIO WEB",
    "solution_title": "Solución",
    "mim": {
      "description": "Este proyecto fue parte del Cisco Mexico University Challenge donde trabajé con un equipo para crear un administrador de incidentes para el área de Supply Chain de Cisco. Este ayudaría a que los empleados pudieran llevar seguimiento de los errores y analizar las posibles soluciones para los nuevos incidentes en base al historial de estos.",
      "stack": {
        "react": "El proyecto debía ser una plataforma interactiva así que se tuvo que elegir un framework para el frontend. Terminamos usando React porque varios de los miembros del equipo habían trabajado con el anteriormente. Además React nos ofrece mucha escalabilidad, la cual era un requerimiento para el proyecto.",
        "flask": "Para el backend escogimos Flask. Implementaríamos algoritmos de machine learning para proveer soluciones a los nuevos incidentes, por lo que la mejor opción era usar Python, sin embargo el equipo no tenía mucha experiencia con este, por lo que Flask era la mejor opción pues es fácil de usar y aprender.",
        "azure": "A medio camino del proyecto, nos dimos cuenta de que se requería una plataforma para guardar archivos, pues los usuarios tendrían la opción de subir reportes o capturas de pantalla. Después de analizar las diferentes opciones nos decidimos por Microsoft Azure Blob Storage por su fácil integración con Flask."
      },
      "motivation": "Los productos de Cisco están creados por compañías de terceros a través del mundo. Estas empresas se rigen por diferentes soluciones tecnológicas, cada una de estas creadas por los diferentes grupos de Cisco, por lo que la visibilidad de las actividades, los planes de cambios y el cómo reaccionar en caso de problemas son difíciles de unificar para los partners de Cisco.",
      "solution": {
        "text": "El producto final es el Master Incident Manager, un administrador de incidentes donde los partners de Cisco tienen un sitio central para analizar y cuantificar los problemas actuales y las causas raíces. Este ayuda a los usuarios a llevar un registro, monitorear y resolver incidentes. Este proyecto toma las siguientes consideraciones:",
        "list": {
          "1": "Es fácil ver los incidentes y su resolución",
          "2": "Es fácil de usar y entender sin importar de las diferencias de idioma",
          "3": "El sistema es capaz de categorizar los incidentes en base a prioridades",
          "4": "La plataforma cuenta con acceso en base a roles",
          "5": "Considera seguridad de la información y protección de red",
          "6": "Ayuda a identificar rápidamente las causas raíz, ya sea de hardware o software"
        }
      }
    },
    "chatify": {
      "description": "Una progressive web application (PWA) en la que puedes chatear con cualquier persona del mundo en tiempo real.",
      "stack": {
        "react": "Esta aplicación tenía que ser creada con un framework para el frontend y React era con el que tenía más experiencia.",
        "socket_io": "Para la comunicación en tiempo real elegí socket.io, un motor rápido y poderoso. Funciona en cualquier plataforma, navegador o dispositivo, así que es la mejor opción.",
        "node": "La integración de socket.io con Express es muy fácil así que decidí usar NodeJs para el backend, para manejar el envío y recepción de mensajes."
      },
      "motivation": "Quería aprender cómo funcionaban los websockets y las PWA's. Además quería mejorar mis habilidades en React así que decidí crear un chat en tiempo real, el cual es un project simple pero impresionante.",
      "solution": {
        "text": "El producto final es una progressive web application que usa un poderoso motor para comunicación en tiempo real en el que puedes enviar mensajes y cualquier persona que esté en la aplicación lo va a recivir. También provee las siguientes características:",
        "list": {
          "1": "Un panel central para ver todos los mensajes que se han enviado a lo largo de la historia del chat",
          "2": "Un panel que muestra todos los usuarios que están actualmente en la sala del chat",
          "3": "Un emoji parser, así que si envías ':D' lo que verás será 😀"
        }
      }
    },
    "hp": {
      "description": "Una divertida página web para todos los Potterheads donde puedes ver datos curiosos, la información de las casas de Hogwarts e incluso descubrir a cuál perteneces.",
      "stack": {
        "gatsby": "Decidí usar Gatsby para este static site porque es uno de los mejores frameworks para React y ayuda a crear websites súper rápidos."
      },
      "motivation": "Soy un Potterhead así que pensé que era una buena oportunidad de mostrarlo y de probar Gatsby, pues he escuchado a mucha gente decir lo rápidas que pueden ser las páginas hechas de estas manera. Lo probé, quedé fascinado y con un buen sabor de boca.",
      "solution": {
        "text": "El producto final es una PWA que cuenta con un modo offline donde puedes ver información acerca de los hechizos usados en las películas de Harry Potter, los personajes y algunos datos curiosos. También provee las siguientes características:",
        "list": {
          "1": "Un componente de Modal con la información de cada una de las casas de Hogwarts",
          "2": "Un lugar donde puedes descubrir a qué casa perteneces",
          "3": "Una página con todos los personajes y los hechizos del mundo mágico mostrados en un cool  componente de Accordion",
          "4": "Una página para descubrir datos curiosos sobre el universo de Harry Potter"
        }
      }
    }
  }
}
